app/controllers/coleccionables_controller.rb

SELECT "coleccionables".* FROM "coleccionables"
---
  def index
    @coleccionables = Coleccionable.all