app/controllers/consolas_controller.rb

SELECT "consolas".* FROM "consolas"
---
  def index
    @consolas = Consola.all

INSERT INTO "consolas" ("created_at", "marca", "nombre", "precio", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-04-26 03:01:26.288726"], ["marca", "Nintendo"], ["nombre", "Wii U"], ["precio", 5999], ["updated_at", "2015-04-26 03:01:26.288726"]]
---
  def create
    @consola = Consola.new(consola_params)

    respond_to do |format|
      if @consola.save

SELECT  "consolas".* FROM "consolas"  WHERE "consolas"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_consola
      @consola = Consola.find(params[:id])