app/controllers/juegos_controller.rb

SELECT "juegos".* FROM "juegos"
---
  def index
    @juegos = Juego.all

INSERT INTO "juegos" ("anio", "created_at", "precio", "publisher", "titulo", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["anio", 2014], ["created_at", "2015-04-25 21:04:58.496406"], ["precio", nil], ["publisher", "Nintendo"], ["titulo", "Mario Kart"], ["updated_at", "2015-04-25 21:04:58.496406"]]
---
  def create
    @juego = Juego.new(juego_params)

    respond_to do |format|
      if @juego.save

SELECT  "juegos".* FROM "juegos"  WHERE "juegos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_juego
      @juego = Juego.find(params[:id])